---
kind: other
id: Methods.T:Autodesk.Revit.UI.Events.IdlingEventArgs
source: html/8a382b97-3b0d-56eb-0c49-3f9d4a2ca10e.htm
---
# IdlingEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.